using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace FormationOfTheOrderDocument
{
    class XMLSerialization
    {

        static string _beginText = "<?xml version=\"1.0\" encoding=\"windows-1251\"?><Файл xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" ИдФайл=\"ON_NSCHFDOPPR_2IG03172f41-bb58-4c73-80e3-5ba6958b5d12_2IGb77a8915-0a8d-4704-b4c3-289fa1e1b201_20201127_d0ca0523-262c-443e-8d2a-6b1821b5df36\" ВерсФорм=\"5.01\" ВерсПрог=\"1.0\"><СвУчДокОбор ИдОтпр=\"2IGb77a8915-0a8d-4704-b4c3-289fa1e1b201\" ИдПол=\"2IG03172f41-bb58-4c73-80e3-5ba6958b5d12\"><СвОЭДОтпр НаимОрг=\"ДИРЕКТУМ ООО\" ИННЮЛ=\"1835056809\" ИдЭДО=\"2IG\" /></СвУчДокОбор><Документ КНД=\"1115131\" Функция=\"ДОП\" ПоФактХЖ=\"Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)\" НаимДокОпр=\"Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (Документ об оказании услуг)\" ДатаИнфПр=\"11.02.2020\" ВремИнфПр=\"16.02.44\" НаимЭконСубСост=\"ИП Созонов Денис Валерьевич\"><СвСчФакт НомерСчФ=\"25-2618273\" ДатаСчФ=\"25.11.2020\" КодОКВ=\"643\"><СвПрод><ИдСв><СвИП ИННФЛ=\"772136001440\" СвГосРегИП=\"29.08.2019\"><ФИО Фамилия=\"Созонов\" Имя=\"Денис\" Отчество=\"Валерьевич\" /></СвИП></ИдСв><Адрес><АдрРФ Индекс=\"125167\" КодРегион=\"77\" Город=\"Москва\" Улица=\"Красноармейская\" Дом=\"8\" Корпус=\"3\" Кварт=\"26\" /></Адрес><Контакт Тлф=\"+79645057722\" /></СвПрод><ГрузОт><ГрузОтпр><ИдСв><СвИП ИННФЛ=\"772136001440\" СвГосРегИП=\"29.08.2019\"><ФИО Фамилия=\"Созонов\" Имя=\"Денис\" Отчество=\"Валерьевич\" /></СвИП></ИдСв><Адрес><АдрРФ Индекс=\"125167\" КодРегион=\"77\" Город=\"Москва\" Улица=\"Красноармейская\" Дом=\"8\" Корпус=\"3\" Кварт=\"26\" /></Адрес><Контакт Тлф=\"+79645057722\" /></ГрузОтпр></ГрузОт><ГрузПолуч><ИдСв><СвЮЛУч НаимОрг=\"ООО «Вайлдберриз», Обособленное подразделение «Подольск»\" ИННЮЛ=\"7721546864\" КПП=\"503645001\" /></ИдСв><Адрес><АдрРФ Индекс=\"142103\" КодРегион=\"50\" Город=\"Подольск\" Улица=\"Поливановская\" Дом=\"9\" /></Адрес><Контакт Тлф=\"8 (495) 775-55-05 \" /><БанкРекв НомерСчета=\"40702810500110000939\"><СвБанк НаимБанк=\"ПАО ВТБ\" БИК=\"044525187\" КорСчет=\"30101810700000000187\" /></БанкРекв></ГрузПолуч><СвПокуп><ИдСв><СвЮЛУч НаимОрг=\"ООО &quot;ВАЙЛДБЕРРИЗ&quot;\" ИННЮЛ=\"7721546864\" КПП=\"997750001\" /></ИдСв><Адрес><АдрРФ Индекс=\"142715\" КодРегион=\"50\" Район=\"Ленинский, с/п Развилковское\" НаселПункт=\"Мильково\" Дом=\"владение 1\" /></Адрес><Контакт Тлф=\"(495)775-55-05\" /><БанкРекв НомерСчета=\"40702810500110000939\"><СвБанк НаимБанк=\"ПАО Банк ВТБ г.Москва\" БИК=\"044525187\" КорСчет=\"30101810700000000187\" /></БанкРекв></СвПокуп><ДопСвФХЖ1 НаимОКВ=\"Российский рубль\" /></СвСчФакт><ТаблСчФакт>";
        static string _endText = "</ТаблСчФакт><СвПродПер><СвПер СодОпер=\"отгрузка товара\" ДатаПер=\"25.11.2020\"><ОснПер НаимОсн=\"Агентский договор\" НомОсн=\"2019/08/30\" ДатаОсн=\"30.08.2019\" /></СвПер></СвПродПер><Подписант ОблПолн=\"0\" Статус=\"1\" ОснПолн=\"Должностные обязанности\"><ИП ИННФЛ=\"772000000000\" СвГосРегИП=\"29.08.2019\"><ФИО Фамилия=\"С\" Имя=\"Д\" Отчество=\"В\" /></ИП></Подписант></Документ></Файл>";

        public string GetXML(Models.Product[] products, Action GenerateXML)
        {
            int count = 0;
            StringBuilder stringBuilder = new StringBuilder(_beginText);
            for(int i =0; i<products.Length;i++)
            {
                if(products[i].Count=="")
                {
                    continue;
                }
                count += int.Parse(products[i].Count);
                stringBuilder.Append("<СведТов НомСтр=\"" + (i + 1) + "\" НаимТов=\"" + products[i].Name + "\" ОКЕИ_Тов=\"796\" КолТов=\"" + products[i].Count + "\" ЦенаТов=\"" + products[i].Price.Split(',')[0] + "\" СтТовБезНДС=\"0\" НалСт=\"без НДС\" СтТовУчНал=\"0\"><Акциз><БезАкциз>без акциза</БезАкциз></Акциз><СумНал><БезНДС>без НДС</БезНДС></СумНал><ДопСведТов ПрТовРаб=\"1\" НаимЕдИзм=\"шт\" НадлОтп=\"" + products[i].Count + "\" КодТов=\"" + products[i].BarCode + "\"/></СведТов>");
            }
            stringBuilder.Append("<ВсегоОпл><СумНалВсего><БезНДС>без НДС</БезНДС></СумНалВсего><КолНеттоВс>"+count+"</КолНеттоВс></ВсегоОпл>");
            stringBuilder.Append(_endText);
            
           
            GenerateXML?.Invoke();
            return stringBuilder.ToString();
        }
    }
}
